---
title: Projets
layout: default
nav_name: projets
---

<h1>Projets</h1>

<div class="applications">
    <section>
        <h3>Jitsi</h3>

        <div style="float: left; margin: 10px 10px 0 0">
        <img src="{{ site.url }}/public/images/sip-comm.png" width="91" height="137" alt="Logo SIP-Communicator" />
        </div>

        <div style="margin-left: 120px">
        <p>
        Jitsi est un t&eacute;l&eacute;phone Internet audio/video ainsi qu'un
        outil de messagerie instantan&eacute;e qui supporte des protocoles de
        t&eacute;l&eacute;honie et de messagerie instantan&eacute;e parmis les plus
        populaires, tels que SIP, Jabber, AIM/ICQ, MSN, Yahoo! Messenger, Bonjour, IRC,
        RSS et bien d'autres.
        </p>

        <p>
        Jitsi est un logiciel libre (Open Source / Free Software) et est
        disponible sous les termes de la licence "GNU Lesser General Public License".
        </p>
        <p><a href="http://www.jitsi.org/" title="http://www.jitsi.org/" rel="external">
        Site web</a></p>
        </div>

        <div class="note clear">
            <p><strong>Contributions</strong></p>
            <ul>
                <li>Int&eacute;gration du protocole DICT permettant de discuter avec
                    un dictionaire comme &agrave; un contact obtenir une d&eacute;finition
                    ou une traduction. Cr&eacute;ation de la librairie associ&eacute;e&nbsp;:
                    dict4j.</li>

                <li>Impl&eacute;mentation des notifications proactives, ie&nbsp;: &ecirc;tre
                    inform&eacute; qu'un contact commence &agrave; &eacute;crire un message.</li>

                <li>Cr&eacute;ation d'un gestionnaire de profil (&eacute;tudiant GSoC'08).
                    Ce projet permet d'avoir plusieurs profils à l'instart de Firefox ou
                    Thunderbird.</li>

                <li>Mentor d'un &eacute;tudiant GSoC durant l'ann&eacute;e 2009 sur le projet :
                    <em>&laquo;Dude, checks out my photo !&raquo;</em>. L'objectif de ce
                    projet est de permettre à l'utilisateur de changer sa photo soit en
                    s&eacute;lectionnant une image ou en prenant une photo &agrave; l'aide
                    de sa webcam.</li>
            </ul>
        </div>
    </section>

    <section>
        <h3>dict4j</h3>

        <p>dict4j est une librarie Java permettant de se connecter avec un serveur de
        dictionaire au format DICT (<a href="http://tools.ietf.org/html/rfc2229">RFC 2229</a>). Elle a &eacute;t&eacute; d&eacute;velopp&eacute;e
        en collaboration avec C&eacute;dric Litzelmann lors d'un projet de premi&egrave;re
        ann&eacute;e de Master d'Informatique pour SIP-Communicator.</p>

        <p>Le code source est disponible sur <a href="http://www.java.net/" rel="external">java.net</a> &agrave; l'adresse suivante&nbsp;: <a href="https://dict4j.dev.java.net/" rel="external">https://dict4j.dev.java.net/</a>
        (d&eacute;p&ocirc;t SVN).</p>
    </section>


    <section class="card">
        <h3>phpSysInfo</h3>

        <div style="float: left; margin: 0 10px 0 10px">
        <img src="{{ site.url }}/public/images/phpsysinfo.png" width="73" height="73" alt="Logo phpSysInfo" />
        </div>
        <div style="margin-left: 90px">
        <p>phpSysInfo est une interface web &eacute;crite en php permettant de r&eacute;cup&eacute;rer du serveur sur lequel il est install&eacute; et de les pr&eacute;senter &agrave; l'utilisateur.</p>
        <p>Site web du projet : <a href="http://phpsysinfo.sourceforge.net/">http://phpsysinfo.sourceforge.net/</a>.</p>
        </div>

        <div class="note clear">
            <p><strong>Contributions</strong></p>
            <ul>
            <li>Maintenance et am&eacute;lioration de la section Mac OS X.</li>
            <li>Mise en place d'un plugin permettant d'afficher les mises &agrave; jour disponibles sous Ubuntu.</li>
            <li>Participation au projet <a href="http://jacky672.github.com/psiandroid/">PSIAndroid</a></li>
            </ul>
        </div>
    </section>

    <section>
        <h3>Projet SensLAB</h3>

        <p>L'objectif du projet SensLAB est le d&eacute;ploiement &agrave; grande &eacute;chelle
        d'une plateforme ouverte de r&eacute;seau de capteurs sans-fil. Le principal but, et le
        plus important, est d'offrir un outil scientifique efficace et pr&eacute;cis pour
        aider &agrave; la construction, d&eacute;veloppement, am&eacute;lioration et exp&eacute;rimentation
        d'applications r&eacute;elles pour de vastes r&eacute;seaux de capteurs sans-fil.</p>

        <p>Cette plateforme est d&eacute;ploy&eacute;e dans 4 villes de France&nbsp;:
        Grenoble, Lille, Rennes, Strasbourg. Pour plus d'informations :
        <ul>
            <li><a href="http://www.senslab.info/" title="http://www.senslab.info/" rel="external">Site Web du projet</a></li>
            <li><a href="http://senslab.unistra.fr/" title="http://senslab.unistra.fr/" rel="external">Site Web de la plateforme de Strasbourg</a></li>
        </ul>
        </p>

        <div class="note">
            <p><strong>Contributions</strong></p>
            <ul>
            <li>Participation au développement d'une <a href="http://senslab.unistra.fr/blog/?post/2010/11/07/DEMO-%3A-CASINO-%28Sensys-2010%29">interface graphique de visualisation</a> et de contr&ocirc;le (interne à l'&eacute;quipe).</li>

                <li>Participation &agrave; la conception de <a href="http://senslab.unistra.fr/index.php?post/2010/08/26/Three-demonstrations-of-using-SensLAB-plateform">d&eacute;mos</a> utilis&eacute;es lors de nombreux &eacute;v&eacute;nements</li>
            </ul>
        </div>
    </section>

    <section>
        <h3>WSNet</h3>

        <p>WSNet est un simulateur de r&eacute;seaux sans fil d&eacute;velopp&eacute; par l'INRIA
        de Lyon. Chaque n&oelig;ud est con&ccedil;us comme un empilement blocs (librairies
        &eacute;crites en C) qui peuvent repr&eacute;senter soit un &eacute;quipement physique
        (carte radio), une application ou une ressource.</p>

        <p>Pour plus d'informations consultez le <a href="http://wsnet.gforge.inria.fr/" title="http://wsnet.gforge.inria.fr/" rel="external">
        site du projet</a>.</p>

        <div class="note">
            <p><strong>Contribution</strong></p>
            <ul>
                <li>Correction d'un bug dans la couche MAC id&eacute;ale cr&eacute;ant une erreur
                    de segmentation lors du routage sur des grandes topologies.
                    Am&eacute;lioration de cette m&ecirc;me couche pour prendre en compte
                    le temps de transmission lors de l'envoi d'un paquet.</li>
          </ul>
        </div>
    </section>
</div>
